* Dereplication

#+BEGIN_SRC sh :noweb-ref dereplication
#!/bin/bash -l
#SBATCH -J dereplication_job
#SBATCH -o dereplication_job_out_%j.txt
#SBATCH -e dereplication_job_err_%j.txt
#SBATCH -t 02:00:00
#SBATCH --mem-per-cpu=2000
#SBATCH --array=1-66
#SBATCH -n 6

# set input file to be processed
name=$(sed -n "$SLURM_ARRAY_TASK_ID"p filtered_files.txt)
out_fasta=$(echo $name | awk -F'_' '{print $1"_"$2"_dereplicated.fasta"}')
out_uc=$(echo $name | awk -F'_' '{print $1"_"$2"_dereplicated.uc"}')
trunc_name=$(echo $name | awk -F'_' '{print $1"_"$2}')

# run the analysis command
vsearch --threads 6 --derep_fulllength $name \
        --strand plus --output $out_fasta \
        --sizeout --uc $out_uc --relabel $trunc_name. 
EOF
#+END_SRC


#+BEGIN_SRC sh :noweb yes :dir :results value verbatim
ls *filtered* > filtered_files.txt

cat <<'EOF' > dereplication.sh
<<dereplication>>
sbatch dereplication.sh
#+END_SRC

#+RESULTS:
: Submitted batch job 33357712


